[
  {
    "permalink": "visiting-anna",
    "text": "I was visiting Anna in the hospital today. Well, I couldn't go inside but since Anna is fine so far we could meet outside, considering the applicable social distance due to Corona. We were chatting a little. I was telling her how much I admire Pawel for his leaned back attitude and reasoning. When Pawel is confronted with an emotionally loaded topic he distances himself first and reflects on the matter, coming back having sorted out his thoughts, bringing real value to the table. This is something especially learned from him, granted I am still learning. Anyway, Anna and I made some stupid jokes again about deleting calendars. It was hilarious. I get all teary when I write this down. I feel like it is still ok to make the calendar joke because I appreciate Pawel so much and am deeply grateful to ever got the chance to know him as a person. Giant Swarm brought all of us together and made these for me so meaningful relationships possible.",
    "background": "bokehballs.001"
  },
  {
    "permalink": "day-zero",
    "text": "You know how it is in other companies. Most people do not even know that you exist. When new people join Giant Swarm and get Slack access before they even worked a single day for the company, there is just an avalanche of greetings, GIFs and rocket emojis and all that cute shit. Sometimes you need to scroll like real bad to see what actually happened in #random when new people join. It is hilarious and so heart warming. Half the company comes running just to welcome you. So and this is then just day zero.",
    "background": "gradient"
  },
  {
    "permalink": "what-a-time",
    "text": "We are pretty much spread around the planet. Hashtag remote first. That one time when we all got together for our onsite, some people had to fly around half the globe only to see each other in person again. Thomas was grinding so hard that he pushed and merged pull requests from 10k altitude flying over the middle of the atlantic ocean. I thought this was some next level shit nobody could ever have imaged only 100 years ago. What a time to be alive.",
    "background": "northernlights"
  },
  {
    "permalink": "chapter-pe",
    "text": "In Chapter PE we had a session recently to discuss how to move forward on a particular issue. There was me, taking on one side of the argument, and there were others, taking another stance. I had a pretty strong opinion, and actually still have it. Eventually we did a fist to five voting to come to a conclusion once everyone got the chance to express their thoughts and arguments on the topic at hand. The vote was against my position and in that moment I wanted to scream and shout and cry in the corner because it hurt inside and I still think somehow we made the wrong decision. It was a super bitter pill to swallow for me in this moment, but nobody got mad. Nobody took it personal. The session ended and we were still all just friends like nothing happened. Sure I took my five minutes to breathe and get over myself. But that was it. The point is, I am grateful to have so many courageous people on my side. People who do not just back up. People who stand their ground and fight for what they think is right in an articulate and civilised manner. People who hold the line. People I can learn so much from. I do not know what is right or wrong in this case, really. But I know that we stand together. I know we can overcome any problem together. And I know that I never stop learning with you on my side.",
    "background": "bokehballs.002"
  },
  {
    "permalink": "laughing",
    "text": "Sometimes I consider not going to the company lunch on Thursdays, because I am too busy. Then I remind myself that is where I get the best laughs all week. In and outside of work.",
    "background": "bokehballs.002"
  },
  {
    "permalink": "colleagues-and-friends",
    "text": "In a moving motivators workshop, Joe mentions that the effect of the growth of the company would increase his relatedness motivator since he would have the opportunity to make new friends.",
    "background": "bokehballs.002"
  },
  {
    "permalink": "good-times",
    "text": "We have a holistic view of people. Work life, a family life,  includeanything life are not silos. People have one life. Organizations need to consider that. It is less about partying and onsites (even if they mean a lot to me <3), it is more about having a purpose in your daily work (no bullshit jobs) and the `go` to self-organize. It is about no boundaries to thinking and getting the information you need to make decisions (transparency) and decide as an adult person what is best for you. It is about the flexibility to integrate all elements of life into your day.",
    "background": "northernlights"
  },
  {
    "permalink": "public-questions",
    "text": "I find, in general, the openness of the Slack channel and not directing questions to one individual who you might feel `safe` asking but going right into forum mode. But not only that, the fact that there is a great openness to answering these questions quickly - because of the forum, not the individual.",
    "background": "bokehballs.002"
  },
  {
    "permalink": "bad-times",
    "text": "The week before Christmas 2015 the company ran out of money. This was a difficult time, but many who stayed with us then are still with us today. Also, we did ultimately make payroll that month.",
    "background": "gradient"
  },
  {
  "permalink": "authority-figures",
  "text": "Timo and Puja publicly encouraging others to question their statements and call bullshit on them where applicable.",
  "background": "bokehballs.001"
  },
  {
  "permalink": "get-job-done",
  "text": "It's all about getting the job done. Not when and where - just get it done. Our culture allows for that because we trust each other.",
  "background": "northernlights"
  },
  {
  "permalink": "acceptable-customers",
  "text": "We said no to Raytheon (a weapons manufacturer) when they came by our booth and were ready to come back later to sign a $1M contract.",
  "background": "bokehballs.002"
  },
  {
  "permalink": "common-sense2",
  "text": "We do stress this term a lot. But it deserves to be stressed. We avoid rules and processes for the sake of itself. Someone not following the common sense? Why `punish` everyone and create one? It simply does not make sense (Counting Holidays, Money spending, restricting information, Self-Organization).",
  "background": "northernlights"
  },
{
  "permalink": "social-swarm",
  "text": "chat- channels and random on Slack, encourage people to share what they care about and be their complete selves at work.",
  "background": "bokehballs.001"
  },
  {
  "permalink": "fluid-roles",
  "text": "Allowing people to change their role definition and their role name as necessary for the employee and the company to thrive.",
  "background": "gradient"
  },
  {
  "permalink": "awesome-box",
  "text": "Let’s try an #awesome-box Slack channel to see if people praise each other. Might not work but we can give it a try. We did. It worked!",
  "background": "bokehballs.002"
  },
  {
  "permalink": "cross-team-work",
  "text": "Salvo volunteering to join Team Firecracker due to Vaclav's holidays to help make progress on a story that was very important to the customer.",
  "background": "northernlights"
  }
]
