[
  {
    "permalink": "visiting-anna",
    "text": "I was visiting Anna in the hospital today. Well, I couldn't go inside but since Anna is fine so far we could meet outside, considering the applicable social distance due to Corona. We were chatting a little. I was telling her how much I admire Pawel for his leaned back attitude and reasoning. When Pawel is confronted with an emotionally loaded topic he distances himself first and reflects on the matter, coming back having sorted out his thoughts, bringing real value to the table. This is something especially learned from him, granted I am still learning. Anyway, Anna and I made some stupid jokes again about deleting calendars. It was hilarious. I get all teary when I write this down. I feel like it is still ok to make the calendar joke because I appreciate Pawel so much and am deeply grateful to ever got the chance to know him as a person. Giant Swarm brought all of us together and made these for me so meaningful relationships possible.",
    "background": "bokehballs.001"
  },
  {
    "permalink": "day-zero",
    "text": "You know how it is in other companies. Most people do not even know that you exist. When new people join Giant Swarm and get Slack access before they even worked a single day for the company, there is just an avalanche of greetings, GIFs and rocket emojis and all that cute shit. Sometimes you need to scroll like real bad to see what actually happened in #random when new people join. It is hilarious and so heart warming. Half the company comes running just to welcome you. So and this is then just day zero.",
    "background": "gradient"
  },
  {
    "permalink": "what-a-time",
    "text": "We are pretty much spread around the planet. Hashtag remote first. That one time when we all got together for our onsite, some people had to fly around half the globe only to see each other in person again. Thomas was grinding so hard that he pushed and merged pull requests from 10k altitude flying over the middle of the atlantic ocean. I thought this was some next level shit nobody could ever have imaged only 100 years ago. What a time to be alive.",
    "background": "northernlights"
  },
  {
    "permalink": "chapter-pe",
    "text": "In Chapter PE we had a session recently to discuss how to move forward on a particular issue. There was me, taking on one side of the argument, and there were others, taking another stance. I had a pretty strong opinion, and actually still have it. Eventually we did a fist to five voting to come to a conclusion once everyone got the chance to express their thoughts and arguments on the topic at hand. The vote was against my position and in that moment I wanted to scream and shout and cry in the corner because it hurt inside and I still think somehow we made the wrong decision. It was a super bitter pill to swallow for me in this moment, but nobody got mad. Nobody took it personal. The session ended and we were still all just friends like nothing happened. Sure I took my five minutes to breathe and get over myself. But that was it. The point is, I am grateful to have so many courageous people on my side. People who do not just back up. People who stand their ground and fight for what they think is right in an articulate and civilised manner. People who hold the line. People I can learn so much from. I do not know what is right or wrong in this case, really. But I know that we stand together. I know we can overcome any problem together. And I know that I never stop learning with you on my side.",
    "background": "bokehballs.002"
  },
  {
    "permalink": "laughing",
    "text": "Sometimes I consider not going to the company lunch on Thursdays, because I am too busy. Then I remind myself that is where I get the best laughs all week. In and outside of work.",
    "background": "laughing"
  },
  {
    "permalink": "colleagues-and-friends",
    "text": "In a moving motivators workshop, Joe mentions that the effect of the growth of the company would increase his relatedness motivator since he would have the opportunity to make new friends.",
    "background": "bokehballs.002"
  },
  {
    "permalink": "good-times",
    "text": "We have a holistic view of people. Work life, a family life,  include anything life are not silos. People have one life. Organizations need to consider that. It is less about partying and onsites (even if they mean a lot to me <3), it is more about having a purpose in your daily work (no bullshit jobs) and the `go` to self-organize. It is about no boundaries to thinking and getting the information you need to make decisions (transparency) and decide as an adult person what is best for you. It is about the flexibility to integrate all elements of life into your day.",
    "background": "northernlights"
  },
  {
    "permalink": "trust",
    "text": "Trust is given from the start and your team really does trust you to complete the work to the best of your ability. This means that there's also a lot of freedom and opportunities to be creative as you're able to interpret and deliver work without strict hardline 'this is how we do it'.",
    "background": "northernlights"
  },
  {
    "permalink": "startup",
    "text": "When I recruit, I always say 'We are an old startup'. We are not a bunch of graduates who do internships. We are experienced but have not reached the point, where 'I made it always like that' is an option. We are not motivated by being a 'fancy Berlin-style' startup (Sorry, Berlin!). We do not need fruits and a soccer table. Our Founders have done this before and we all know how to work. We do not save money when it comes to salaries, equipment or external advice. We follow the rules when they have to be followed.",
    "background": "northernlights"
  },
  {
    "permalink": "pull-culture",
    "text": "My job at Giant Swarm focuses on recruiting and employer branding. The first part is pretty straightforward but employer branding has many different aspects to it. Initially, I was waiting for someone to tell me what they had in mind and what they expected from me. It took me quite a while (also because recruiting initially took up most of my time) and some clear words from Oli to realise that they’ve been waiting for me to come up with ideas. This made the pull-culture pretty obvious for me. Noone would tell me what to do but instead I had to tell them what I wanted and needed.",
    "background": "northernlights"
  },
  {
    "permalink": "common-sense",
    "text": "Working at Giant Swarm comes with many many advantages that you’d hardly find in such a combination in other companies. And many people I tell about this ask me how this was possible. And eventually, I guess, it comes down to our often cited 'common sense'. We realise that these advantages are only possible because we all play by the rules. When we want the flexibility to work whenever we want, we also need to make sure that we don’t miss out on crucial meetings and that we get our stuff done in time. This system doesn’t work if we wouldn’t do our jobs properly. Same applies to taking as many days off as we want. If all of us would take 100 days of per year, the company couldn’t survive but there is no problem if we all take between 25-35 days.",
    "background": "northernlights"
  },
  {
    "permalink": "meta-listening",
    "text": "In other companies I’ve worked at, if you feel 'negative' emotions (sad, frustrated, just blah), it wasn’t explicitly said 'don’t say that', but the common practice is to keep it to yourself and you just have to deal with it. Here, well you have to deal with it but it’s also common practice to articulate your feelings. For example, in #meta-listening slack channel. And we’re constantly being asked 'how do you feel?' specifically. I guess the meta-listening is just an illustration of our overall common practice of being ok to feel things :D Recognizing that unpleasant feelings are part of the normal human experience, and encouraging people to not take it as a personal defect.",
    "background": "northernlights"
  },
  {
    "permalink": "agile",
    "text": "Yes, we are an international team, yes, we are fully remote, yes, we are diverse when it comes to characters. But this was an evolving process. We went remote step by step and made our learnings, we started with Europe, as nobody has solved the time zone yet, and are now ready for the world. We did not hire a certain nationality in a row (like: Now, we open an office in the US); we did not only hire extroverts only. We put a lot of thought into ensuring that as different as people are, a few basic beliefs are shared. Now this scales.",
    "background": "northernlights"
  },
  {
    "permalink": "transparency",
    "text": "Transparency starts at the interview. During interviews, a lot of things are said by the people who interview you. Most of the times only 50% are true. At Giant Swarm, I still haven't found anything.",
    "background": "northernlights"
  },
  {
    "permalink": "fail-fast",
    "text": "'If it hurts, do more of it' - I told my dad that it's a fail-fast environment and he told me I should fit right in ;D",
    "background": "northernlights"
  },
  {
    "permalink": "unlimited-holidays",
    "text": "Why we do we not count holidays or work time? This goes back to the original founding of Giant Swarm, where we said that we need very good people and these people do not work only for money. Of-course they need to be paid but they are all at a level where, on average, they do not move jobs for money, but rather for an interesting environment, good work topics, great people, and so forth. Self-actualisation if you will. They come to a company because they like the vision, the idea, and are intrinsically motivated to work there. As with most people, there are very few things I can do to closely monitor and control those people and it is already known that control is not a good motivator. Hence, my job as a “manager” needs to be to make you WANT to work. As a next step, if I manage to do that, and make sure to make it clear that everyone takes the rest they need, then I should just let you do that. Take rest, when and where you want. Especially in our current setting you might take your laptop to holidays and do a few hangouts from there, or read a business book on the weekend, play poker with friends and get one as a customer. The line between personal and work life blurs more and more and I want to support that, because it should. But, it should in a way that does not create stress. Quote: We all learned to answer our email on saturday morning but not to go to the cinema on tuesday at 14:00 - Ricardo Semler",
    "background": "northernlights"
  },
  {
    "permalink": "honest-learning-environment",
    "text": "From the beginning, everyone is super transparent about the steep learning curve involved in understanding and mastering your tasks. This honesty fosters an open-dialogue and a more productive learning environment.",
    "background": "northernlights"
  },
  {
    "permalink": "afk-for-everything",
    "text": "AFK channel includes notes about family illness, going to the gym, taking a walk, and cooking lunch. To name just a few. People are encouraged to have a life outside of work.",
    "background": "northernlights"
  },
  {
    "permalink": "sharing-is-caring",
    "text": "Communication can be formal or informal, it can be oral or written. I love our chat- insert topic people are interested (eg politics, music, pets, parenting, sports, book etc) channels. Why? Because people with less business touch points talk to each other, because more introverted people share, because you chose about what you want to talk <3 As a plus: We also have the channel #YELLING and #metalistening. For me this highlights what a safe space Giant Swarm is for working.",
    "background": "northernlights"
  },
  {
    "permalink": "sustainability",
    "text": "Beyond claiming that we care for the environment, we actively offset all flight emissions that are a result of company-related travel.",
    "background": "northernlights"
  },
  {
    "permalink": "leadership",
    "text": "The definition of a manager is a barrier removal professional and above that we, the founders, were always like that, giving people freedom and allowing them to do work. We don't like to 'give' people tasks.",
    "background": "northernlights"
  },
  {
    "permalink": "safe-place-to-share",
    "text": "In Slack, somebody transparently said they were suffering from imposter syndrome as everybody else always seemed so productive / good at what they did and they didn't feel the same way. The reactions were so overwhelming and kind, it taught me a lot about the culture even before I started.",
    "background": "northernlights"
  },
  {
    "permalink": "away-from-keyboard",
    "text": "In the AFK Slack channel, people openly state all kinds of random reasons why they are not at their keyboard for a while. This has really helped me to understand how 'flexible work hours' and 'self-responsibility' were lived at GS. Furthermore, it is a sign for trust because false excuses or secret AFKs seem to be way less likely to occur.",
    "background": "northernlights"
  },
  {
    "permalink": "fair-salaries",
    "text": "Giant Swarm might be the only company who never asked me for my salary expectations. Or worse, try to extract what I was getting paid before in order to not risk “overpaying” me. What this means to me is Giant Swarm is not a company that takes advantage of people who don't negotiate or people who started at or are coming from low salary positions. Every company says people are their most important assets. But right from the start, this is disproven when the relationship starts with the company taking advantage of their bargaining position and allowing salaries to wildly converge not because of value but because of employees’ lack of market information.",
    "background": "northernlights"
  },
  {
    "permalink": "communication-is-key",
    "text": "We had a P1 incident with adidas with the global login system failing on a Saturday afternoon. We congregated on Slack with 4 people in total and tried to get to the bottom of it. I was the communication channel and it again showed you need little information to help the customer get through something hard, as I chatted along with the customer on support, telling stories, making jokes, giving updates or simple 'we are still on it btw' statuses. We really focussed on getting them working and gelled well as a team. In the end we managed to find a very difficult problem and the entire time the customer was stressed but happy that we could get it done or rather that if someone could, it was us. This was one of the reasons adidas chose us, we are ready for all problems that might arise.",
    "background": "northernlights"
  },
  {
    "permalink": "public-questions",
    "text": "I find, in general, the openness of the Slack channel and not directing questions to one individual who you might feel `safe` asking but going right into forum mode. But not only that, the fact that there is a great openness to answering these questions quickly - because of the forum, not the individual.",
    "background": "bokehballs.002"
  },
  {
    "permalink": "bad-times",
    "text": "The week before Christmas 2015 the company ran out of money. This was a difficult time, but many who stayed with us then are still with us today. Also, we did ultimately make payroll that month.",
    "background": "gradient"
  },
  {
  "permalink": "authority-figures",
  "text": "Timo and Puja publicly encouraging others to question their statements and call bullshit on them where applicable.",
  "background": "bokehballs.001"
  },
  {
  "permalink": "get-job-done",
  "text": "It's all about getting the job done. Not when and where - just get it done. Our culture allows for that because we trust each other.",
  "background": "northernlights"
  },
  {
  "permalink": "acceptable-customers",
  "text": "We said no to Raytheon (a weapons manufacturer) when they came by our booth and were ready to come back later to sign a $1M contract.",
  "background": "bokehballs.002"
  },
  {
  "permalink": "common-sense2",
  "text": "We do stress this term a lot. But it deserves to be stressed. We avoid rules and processes for the sake of itself. Someone not following the common sense? Why `punish` everyone and create one? It simply does not make sense (Counting Holidays, Money spending, restricting information, Self-Organization).",
  "background": "northernlights"
  },
{
  "permalink": "social-swarm",
  "text": "chat- channels and random on Slack, encourage people to share what they care about and be their complete selves at work.",
  "background": "bokehballs.001"
  },
  {
  "permalink": "fluid-roles",
  "text": "Allowing people to change their role definition and their role name as necessary for the employee and the company to thrive.",
  "background": "gradient"
  },
  {
  "permalink": "awesome-box",
  "text": "Let’s try an #awesome-box Slack channel to see if people praise each other. Might not work but we can give it a try. We did. It worked!",
  "background": "bokehballs.002"
  },
  {
  "permalink": "cross-team-work",
  "text": "Salvo volunteering to join Team Firecracker due to Vaclav's holidays to help make progress on a story that was very important to the customer.",
  "background": "northernlights"
  }
]
